package ru.mirea.kornilov.listviewapp

import android.os.Bundle
import android.widget.ListView
import androidx.appcompat.app.AppCompatActivity

class MainActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        val listView = findViewById<ListView>(R.id.book_list_view)
        listView.adapter = BookAdapter(this, books)
    }

    private val books = listOf(
        Book("Лев Толстой", "Война и мир"),
        Book("Фёдор Достоевский", "Преступление и наказание"),
        Book("Фёдор Достоевский", "Братья Карамазовы"),
        Book("Александр Пушкин", "Евгений Онегин"),
        Book("Николай Гоголь", "Мёртвые души"),
        Book("Антон Чехов", "Вишнёвый сад"),
        Book("Иван Тургенев", "Отцы и дети"),
        Book("Михаил Булгаков", "Мастер и Маргарита"),
        Book("Михаил Лермонтов", "Герой нашего времени"),
        Book("Александр Солженицын", "Архипелаг ГУЛАГ"),
        Book("Борис Пастернак", "Доктор Живаго"),
        Book("Иван Гончаров", "Обломов"),
        Book("Александр Островский", "Гроза"),
        Book("Максим Горький", "На дне"),
        Book("Андрей Платонов", "Котлован"),
        Book("Варлам Шаламов", "Колымские рассказы"),
        Book("Гомер", "Одиссея"),
        Book("Данте Алигьери", "Божественная комедия"),
        Book("Мигель де Сервантес", "Дон Кихот"),
        Book("Уильям Шекспир", "Гамлет"),
        Book("Иоганн Вольфганг Гёте", "Фауст"),
        Book("Виктор Гюго", "Отверженные"),
        Book("Чарльз Диккенс", "Большие надежды"),
        Book("Джейн Остин", "Гордость и предубеждение"),
        Book("Герман Мелвилл", "Моби Дик"),
        Book("Марк Твен", "Приключения Гекльберри Финна"),
        Book("Фёдор Достоевский", "Идиот"),
        Book("Джеймс Джойс", "Улисс"),
        Book("Марсель Пруст", "В поисках утраченного времени"),
        Book("Франц Кафка", "Процесс"),
        Book("Габриэль Гарсиа Маркес", "Сто лет одиночества"),
        Book("Джордж Оруэлл", "1984"),
        Book("Харпер Ли", "Убить пересмешника"),
        Book("Дж. Р. Р. Толкин", "Властелин колец"),
        Book("Умберто Эко", "Имя розы"),
        Book("Харуки Мураками", "Норвежский лес")
    )
}
